_org/_posts/dev/2018-07-30-rails.org
#+begin_export html
---
layout: post
title: "Rails 学习"
date: 2018-07-30
categories: 程序设计
tags:
    - Rails
---
#+end_export


* 命令缩写

| 完整命令         | 缩写命令   |
|------------------+------------|
| bundle install   | bundle     |
| rails server     | rails s    |
| rails console    | rails c    |
| rails generate   | rails g    |
| rails test       | rails t    |

* Rails 指令

我们已经陆续使用过一些指令了，让我们看看全部的指令吧：

** generate 可缩写为 g

产生各种不同类型的档案，例如

#+BEGIN_EXAMPLE
    bin/rails generate model person
    bin/rails g controller people
#+END_EXAMPLE

** console 可缩写为 c

开启一个 Rails 主控台

#+BEGIN_EXAMPLE
    bin/rails console
    bin/rails c
#+END_EXAMPLE

默认的环境是
developement，如果需要指定环境，请多输入环境名称即可，例如：

#+BEGIN_EXAMPLE
    bin/rails c production
#+END_EXAMPLE

Rails
也有提供沙箱模式(Sandbox)，任何数据库的修改都会在离开时回复(原理是数据库
Transaction)：

#+BEGIN_EXAMPLE
    bin/rails c --sandbox
#+END_EXAMPLE

在主控台中输入 exit 就会离开。

** server 可缩写为 s

开启一个 Rails 服务器

#+BEGIN_EXAMPLE
    bin/rails s
#+END_EXAMPLE

默认是使用 Port 3000 和 development 环境，如果需要指定：

#+BEGIN_EXAMPLE
    bin/rails s -p 4000 -e production
#+END_EXAMPLE

** new

建立一个新 Rails 专案

#+BEGIN_EXAMPLE
    bin/rails new my_app
#+END_EXAMPLE

将会建立一个叫做 MyApp 的 Rails 专案在 ./my_app 目录下。加上--database
参数可以改变设定档的默认值，例如：

#+BEGIN_EXAMPLE
    bin/rails new my_app --database=mysql
#+END_EXAMPLE

其他说明可以输入 rails 看到全部的指令。

** 其他指令

- dbconsole 开起一个数据库主控台 (可简写为 rails db)，让你直接输入 SQL
  指令。
- destroy 删除 "generate" 所产生的档案
- runner 在 Rails 环境中执行一段程式，例如 rails runner "puts
  Person.count"

* Rails 启动与应用程式设定

不同的 Rails 版本产生的设定档可能会略有差异，这些设定档也没有列出所有
Rails 设定，只有列出比较常用的。

启动整个 Rails 程序(包括 rails server, rails runner, rails console 等)
时，会执行 application.rb
的应用程式设定，让我们来看看这个档案一些比较重要的部分吧。如果你对这个档案有修改，无论在什么模式下，都必须重新启动
Rails 设定才会生效。

#+BEGIN_EXAMPLE
    # Set Time.zone default to the specified zone and make Active Record auto-convert to this zone.
    # Run "rake -D time" for a list of tasks for finding time zone names. Default is UTC.
    # config.time_zone = 'Central Time (US & Canada)'
#+END_EXAMPLE

设定默认的应用程式时区，默认是 UTC。在 Rails
中，数据库里面储存的时间皆为 UTC
时间，而设定此时区会自动帮你处理转换动作。例如设定 Taipei
的话，从数据库读取出来时会自动加八小时，存进数据库时会自动减八小时。

#+BEGIN_EXAMPLE
    # The default locale is :en and all translations from config/locales/*.rb,yml are auto loaded.
    # config.i18n.load_path += Dir[Rails.root.join('my', 'locales', '*.{rb,yml}').to_s]
    # config.i18n.default_locale = :de
#+END_EXAMPLE

设定默认的应用程式语系，默认是:en。在"I18n 多国语系及时区"查询如何使用。

** 其他初始设定档(initialzers)

如果将所有的设定都放到 application.rb 就太混乱了，所以非 Rails
核心的设定，我们会放在 config/initializers 目录下。这个目录下的所有.rb
档案会在 Rails 启动时都会自动加载执行。默认产生的档案有五个：

** filter_parameter_logging

#+BEGIN_EXAMPLE
    # Configure sensitive parameters which will be filtered from the log file.
    Rails.application.config.filter_parameters += [:password]
#+END_EXAMPLE

设定 filter_paramsters 可以避免任何叫做 password 的参数值记录到 log
中，有效防止使用者的原始密码外洩到 log 档案。

** backtrace silencers

可以让你选择性地移除例外追踪(exception
backtrace)讯息，例如有些套件可能会很吵，妨碍你除错。

** inflections

Rails 的命名惯例十分倚赖英文的单复数，例如将单数的类别名称 Person
转成复数的表格名称 people。Inflector
就是负责将字串转换成单复数的类别，虽然它内建了一些基本的转换规格，但是英文常常有例外的时候，你可以在这个档案中加上新的规格来做修正。如果你不太确定
Rails 转换的对不对，请进入 console 主控台试试看：

#+BEGIN_EXAMPLE
    $ rails c
    $ Loading development environment (Rails 3.2.8)
    $ > "Business".singularize  => "Busines" # 转单数
    $ > "moose".pluralize => "mooses"  # 转复数
#+END_EXAMPLE

很不幸地这两个例子 Rails 都没转对，这时候你就可以利用 inflections.rb
来修正。

Rails 核心不接受有关单复数转换的单字错误回报，毕竟它不是想做字典。

** mime_types

Rails 默认支援了如下常见的标准 MIME(Multipurpose Internet Mail
Extensions) 格式，MIME 被用在 HTTP 通讯协定中的请求标头 Accept
和回应标头 Content-Type 中，来说明此文件的格式。例如
Accept:application/xml,application/xhtml+xml,text/html; 和
Content-Type:text/html; charset=UTF-8。而 Rails 会在 Controller 的
respond_to 方法中辨识并回应所请求的格式样板，例如浏览器请求
application/xml 就会回应 xml 格式

#+BEGIN_VERSE
  type/subtype | respond_to symbol | 别名/说明 |
  text/html | :html, :xhtml | application/xhtml+xml |
  text/plain | :text, :txt | |
  text/javascript | :js | application/javascript, application/x-javascript |
  text/css | :css | |
  text/calendar | :ics | iCalendar 格式 |
  text/csv | :csv | |
  application/xml | :xml | text/xml, application/x-xml |
  application/rss+xml | :rss | |
  application/atom+xml | :atom | |
  application/x-yaml | :yaml | text/yaml |
  application/x-www-form-urlencoded | :url_encoded_form | 默认的 HTML forms 格式 |
  multipart/form-data | :multipart_form | HTML forms 格式(包含二进制档案资料) |
  application/json | :json | text/x-json application/jsonrequest |
#+END_VERSE

如果你需要定制，可以在这里注册。

** sesssion_store

Rails 默认使用了 Cookie 来储存 Session 讯息。它会用上述的 key
编码之后，直接存放在使用者浏览器 Cookie 上。除了 Cookie
Session，我们也可以使用 ActiveRecord 储存在数据库中。我们会在 Controller
一章中详细介绍及比较。

** config/secrets.yml

这个设定档包括了乱数产生的一组 secret_key_base 用来编码需要保护的 Cookie
讯息。修改这组 key 会让已经存放在使用者浏览器上的 Cookie Session 和
Signed Cookie 失效。你可以用来强制使用者需要重新登入。

#+BEGIN_EXAMPLE
    development:
      secret_key_base: 8dd8d723d33d474710ab65b....
      some_api_key: SOMEKEY

    test:
      secret_key_base: 175fa99b200ba23cf82fec6c....

    # Do not keep production secrets in the repository,
    # instead read values from the environment.
    production:
      secret_key_base: <%= ENV["SECRET_KEY_BASE"] %>
#+END_EXAMPLE

除了本来的 secret_key_base
之外，你也可以用这个档案放其他设定，例如第三方应用的 Key 或
Token。上述的例子透过 Rails.application.secrets.some_api_key
方法就会回传 SOMEKEY。

#+BEGIN_QUOTE
  请小心这个档案不要将 production 用的 secret 公开，例如上传到 Github
  的公开储存库。因为如果有人拿到 secret_key_base 那他就可以破解 Rails
  默认的 Cookie-based Session，造成安全上的严重漏洞。一般 Production
  环境的作法是会将含有 production 完整设定的 config/secrets.yml
  只放一份在服务器上，或是透过环境变量来设定。详细的作法可以参考布署一章。
#+END_QUOTE

* 环境设定档

我们在上一节”多重环境设定”曾经介绍不同环境会有不同的设定档，让我们来更深入看看有哪些设定值，以及这些值是如果影响
Development、Production 和 Test 环境的不同：

