_posts/dev/2018-07-30-rails.html

<div id="outline-container-orgb607237" class="outline-3">
<h3 id="orgb607237"><span class="section-number-3">4.1</span> 多重环境</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Rails 应用程式默认提供了三种不同的执行模式：
</p>

<ul class="org-ul">
<li>development environment 开发模式，用在你的开发的时候</li>
<li>test environment 测试模式，用在执行测试程式时</li>
<li>production environment 正式上线模式，用在实际的上线运作环境</li>
</ul>

<p>
不同环境的差异在于有不同的设定，除了数据库设定 database.yml
里分开设定之外，个别的环境设定放在
config/environments/development.rb、config/environments/test.rb 和
config/environments/production.rb，它们可以有不同的 Log 层级、Session
设定、Email
设定等等。除了默认的这三种模式，我们也可以自定模式，只需要建立对应的档案即可，例如
config/environments/staging.rb。我们会在下一节详述这些档案里面的设定。
</p>

<p>
staging 可以用来表示准上线模式，用来做正式上线前的 QA 测试用途。
</p>

<p>
因为程式本身是不是写死是哪一种执行模式，那么要怎么区分呢？根据不同情况有不同方法，包括：
</p>

<p>
根据环境变量 RAILS_ENV 或 RACK_ENV 来决定使用哪一种模式，例如使用 rake
时：
</p>

<pre class="example">
RAILS_ENV=production bin/rake db:migrate
</pre>

<p>
指令根据参数决定:
</p>

<pre class="example">
bin/rails console production
bin/rails server -e production
</pre>

<p>
最后，应用程式服务器则看服务器设定档，例如 Passenger 里会设定 RackEnv
参数，布署一章会详细介绍。
</p>
</div>
</div>

<div id="outline-container-org7192172" class="outline-3">
<h3 id="org7192172"><span class="section-number-3">4.2</span> 环境判断</h3>
<div class="outline-text-3" id="text-4-2">
<pre class="example">
Rails.env.development?
Rails.env.test?
Rails.env.production?
</pre>
</div>
</div>

<div id="outline-container-org2874924" class="outline-3">
<h3 id="org2874924"><span class="section-number-3">4.3</span> 生成生产环境数据库</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">
<pre class="src src-sh">rails db:migrate <span style="color: #7590db;">RAILS_ENV</span>=production
</pre>
</div>
</div>
</div>

<div id="outline-container-org1f106ed" class="outline-3">
<h3 id="org1f106ed"><span class="section-number-3">4.4</span> 启动生产环境</h3>
<div class="outline-text-3" id="text-4-4">
<div class="org-src-container">
<pre class="src src-sh">rails server -- environment production
</pre>
</div>
</div>
</div>

<div id="outline-container-org6ca5431" class="outline-3">
<h3 id="org6ca5431"><span class="section-number-3">4.5</span> Development 模式</h3>
<div class="outline-text-3" id="text-4-5">
<pre class="example">
# In the development environment your application's code is reloaded on
# every request. This slows down response time but is perfect for development
# since you don't have to restart the web server when you make code changes.
config.cache_classes = false
</pre>

<p>
使用 Rails
开发可以快速的原因之一，就是当你修改一个小东西，只要重新整理浏览器就可以马上看到修改后的结果。这个秘诀就在于
cache_classes = false 会让每一次的 HTTP
请求都重新加载类别档案。更仔细的说，当这个值是 false 的时候，Rails
会改用 Ruby 的 load 方法，每次执行都会重新加载一次。相反地，如果这个值是
true，则会用 Ruby 的 require 方法，只会在第一次碰到的时候加载，之后碰到
require 相同的档案，就会自动忽略，也就是说如果你启动 Rails
后，档案有修改想看到结果，必须重新启动 Rails
才行，否则无法立即看到结果。
</p>

<pre class="example">
# Show full error reports and disable caching
config.consider_all_requests_local = true
</pre>

<p>
Rails 只有在连线是来自本地端的时候，才会将发生错误时的 Call stack trace
资讯给浏览器显示。这个设定将所有连线都当做本地端连线，好让开发模式时所有人连线都可以看到错误讯息。
</p>

<pre class="example">
config.action_controller.perform_caching = false
</pre>

<p>
是否启用 Controller 层级的快取(我们会在 Controller
一章介绍到有哪些快取方法)，一般来说在开发模式不会启用，除非你要测试它。
</p>

<pre class="example">
# Don't care if the mailer can't send
config.action_mailer.raise_delivery_errors = false
</pre>

<p>
如果寄信失败，是否要丢出例外。建议可以改成 true。
</p>

<p>
建议可以在开发模式设定 config.action_mailer.perform_deliveries =
false，这样就不会真的寄信出去。我们会再 ActionMailer
一章详细介绍如何实作寄信功能。
</p>

<pre class="example">
# Print deprecation notices to the Rails logger
config.active_support.deprecation = :log
</pre>

<p>
随着 Rails 版本的升级，如果有方法会在之后的版本中移除，deprecation
会提示你如何因应。这里的 :log 表示会记录到 log 档案中。
</p>
</div>
</div>

<div id="outline-container-orgd2b8894" class="outline-3">
<h3 id="orgd2b8894"><span class="section-number-3">4.6</span> Production 模式</h3>
<div class="outline-text-3" id="text-4-6">
<pre class="example">
# The production environment is meant for finished, "live" apps.
# Code is not reloaded between requests
config.cache_classes = true
</pre>

<p>
cache_classes = true 表示在 production
中，类别档案加载进内存中就快取起来了，大大获得效能。不像在 development
环境中每一次 HTTP 请求就会重新加载一次。
</p>

<pre class="example">
# Full error reports are disabled and caching is turned on
 config.consider_all_requests_local       = false
config.action_controller.perform_caching = true
</pre>

<p>
不同于 development，如果在 production 环境出现例外错误，不会显示程式
call stack 讯息，而是回传 public/500.html 页面。
</p>

<pre class="example">
# Disable Rails's static asset server (Apache or nginx will already do this)
config.serve_static_assets = false
</pre>

<p>
"X-Sendfile"
是网页服务器提供的功能，可以让下载档案的动作完全委派给网页服务器，Rails
送出 X-Sendfile 标头后就毋需再佔住资源。
</p>

<pre class="example">
# Force all access to the app over SSL, use Strict-Transport-Security, and use secure cookies.
# config.force_ssl = true
</pre>

<p>
是否限制全站必须 SSL 才能使用。
</p>

<pre class="example">
# See everything in the log (default is :info)
# config.log_level = :debug
</pre>

<p>
我们在 RESTful 应用程式 一章最后介绍了 Logger。这里可以设定 Logger
的层级。默认 production 是 :info，其他则是 :debug
</p>

<pre class="example">
# Use a different logger for distributed setups
# config.logger = ActiveSupport::TaggedLogging.new(SyslogLogger.new)
</pre>

<p>
可以更换掉 Rails 内建的 Logger，例如换成使用 syslog 的 SyslogLogger。
</p>

<pre class="example">
# Use a different cache store in production
# config.cache_store = :mem_cache_store
</pre>

<p>
设定不同的快取储存库，默认是 :memory_store，也就是每个 Rails process
各自用内存存放。业界最常用的则是 memcached 内存快取服务器。
</p>

<pre class="example">
# Enable serving of images, stylesheets, and javascripts from an asset server
# config.action_controller.asset_host = "http://assets.example.com"
</pre>

<p>
默认的静态档案位置是目前主机的 public 目录，你可以透过修改 asset_host
变更位置。例如你的静态档案放在不同台机器或 CDN(Content delivery network)
上。
</p>

<p>
这就是为什么 Rails 在 View 中会使用 Helper
方法的原因之一，我们不会平舖直叙的写 ，而是使用 &lt;%=
image_tag("rails.png") %&gt;
目的就在于透过程式来获得修改位置的弹性。其他还包括
stylesheets、javascripts 等静态档案都有 Helper 可以使用。
</p>

<pre class="example">
# Disable delivery errors, bad email addresses will be ignored
# config.action_mailer.raise_delivery_errors = false

# Enable locale fallbacks for I18n (makes lookups for any locale fall back to
# the I18n.default_locale when a translation can not be found)
config.i18n.fallbacks = true
</pre>

<p>
如果 I18n 翻译档找不到，则找用默认语系的文字。我们会在 I18n
一章详细介绍多国语系功能。
</p>

<pre class="example">
# Send deprecation notices to registered listeners
config.active_support.deprecation = :notify
</pre>

<p>
将 deprecation 讯息传到 Notifications
频道，你可以用以下程式去订阅这个讯息：
</p>

<pre class="example">
ActiveSupport::Notifications.subscribe("deprecation.rails") do |message, callstack|
  # deprecation message
end
</pre>

<p>
如果没有订阅的话，就什么事都不会发生。
</p>
</div>
</div>

<div id="outline-container-org9956e48" class="outline-3">
<h3 id="org9956e48"><span class="section-number-3">4.7</span> Test 模式</h3>
<div class="outline-text-3" id="text-4-7">
<pre class="example">
# Show full error reports and disable caching
config.consider_all_requests_local       = true
config.action_controller.perform_caching = false

# Raise exceptions instead of rendering exception templates
config.action_dispatch.show_exceptions = false
</pre>

<p>
不同于 development 或 production 碰到例外会捕捉例外后，给浏览器显示出
call stack trace 或 public/500.html 画面，在 test
模式就不处理，让例外直接爆出。
</p>

<pre class="example">
# Tell Action Mailer not to deliver emails to the real world.
# The :test delivery method accumulates sent emails in the
# ActionMailer::Base.deliveries array.
config.action_mailer.delivery_method = :test
</pre>

<p>
测试模式下不会真的去寄送 email
</p>

<pre class="example">
# Print deprecation notices to the stderr
config.active_support.deprecation = :stderr
</pre>

<p>
让 deprecation 讯息会直接显示到视窗之中。
</p>
</div>
</div>
</div>

<div id="outline-container-orgef668ae" class="outline-2">
<h2 id="orgef668ae"><span class="section-number-2">5</span> 数据库设定档 database.yml</h2>
<div class="outline-text-2" id="text-5">
<p>
几乎每一个 Rails 应用程式都会与数据库互动。而数据库需要一个设定档是
config/database.yml。如果你打开这个档案，你会发现默认设定是
SQLite3。这个档案包含三个不同的部分，对应到三个 Rails 默认环境。
</p>

<p>
一个 Mysql 的设定档范例如下：
</p>

<pre class="example">
development:
  adapter: mysql
  encoding: utf8mb4
  database: blog_development
  username: root
  password:
production:
  adapter: mysql
  encoding: utf8mb4
  database: blog_production
  username: root
  password:
test:
  adapter: mysql
  encoding: utf8mb4
  database: blog_test
  username: root
  password:
</pre>
</div>
</div>
