_posts/dev/2018-07-30-rails.html

<div id="outline-container-org7316d43" class="outline-2">
<h2 id="org7316d43"><span class="section-number-2">6</span> Bundler 与 Gemfile 设定档</h2>
<div class="outline-text-2" id="text-6">
<p>
Bundler <a href="http://gembundler.com/">http://gembundler.com/</a> 是管理应用程式 Gem
依存性(dependencies)管理工具，它会根据 Gemfile 的设定自动下载及安装 Gem
套件，并且帮你解决不同套件之间的依存关系，更重要的是，它可以让不同开发者之间和布署时，所有依存套件的版本都能够一致。
</p>

<p>
在 Rails3 之后要使用的 Gems，都必须宣告在 Gemfile
设定档中，没写在里面的话，就算手动 require 也找不到。这跟 Rails2
以前可以直接 require 任意 rubygems 不同，在使用 Bundler 的环境中，要
require 什么 rubygems 必须透过 Gemfile 管理。
</p>

<blockquote>
<p>
Bundler 不只用在 Rails，其他例如 Sinatra 或是旧版 Rails2 也都可以使用
</p>
</blockquote>

<p>
Gemfile 的写法说明如下：
</p>

<pre class="example">
# 第二个参数可以指定版本
gem "rails", "5.1.0"

# 也可以不指定版本，这样会安装最新的稳定版本 (不包括 .pre 或 .rc 结尾的版本)
gem 'mysql2'

# 如果 require 的档名不同，可以加上 :require
gem 'yajl-ruby', :require =&gt; 'yajl'

# 可以用 Git 当做来源(根目录要有 .gemspec 档案)，甚至可以指定 branch, tag 或 ref。
gem 'authlogic', :git =&gt; 'git://github.com/odorcicd/authlogic.git',
                          :branch =&gt; 'rails3'

# 也可以直接用电脑里的其他目录
# gem "rails", :path =&gt; '/Users/ihower/github/rails'

# Group 功能可以让特定环境才会加载
group :development, :test do
    gem "rspec", "~&gt; 2.0"
    gem "rspec-rails", "~&gt; 2.0"
end
</pre>

<p>
版号的指定方式除了指定特定版本，还可以指定大于等于 &gt;=
某个版本。不过最建议的方式则是使用 ~&gt; 的语法。”~&gt; x.y.z” 的意思是版号
x,y 固定，但可以大于等于 z。例如 "~&gt; 1.3.5" 的意思是 1.3.5, 1.3.6, 1.3.9
可以安装，但是 1.4.0, 1.5.5, 2.0.1
就不行。这种写法的好处是，通常版号的命名有其惯例：x major 版号升级表示有
API 发生不向后的相容性变动，y minor 版号升级表示有功能新增，z tiny
版号升级表示 bugs 修正。因此 "~&gt; x.y.z"
可以让我们保有升级弹性，又不致于升级太多让程式发生不相容错误。这种命名是开放源码社群的惯例，叫做
Semantic Versioning。
</p>
</div>

<div id="outline-container-orgdd4653c" class="outline-3">
<h3 id="orgdd4653c"><span class="section-number-3">6.1</span> 安装及更新 Gems</h3>
<div class="outline-text-3" id="text-6-1">
<p>
如果你修改了这个档案，请执行 bundle install，这样 Bundler
就会检查并安装这些函式库，并产生一个 Gemfile.lock 档案。Gemfile.lock
档案会详细列出所有使用到的套件版本，你应该把这个档案也 commit
送进版本控制系统，这样其他开发者及上线的版本就都会安装完全一样的版本了。
</p>

<p>
执行 bundle update gem_name 则会更新此 gem 的版本。bundle update
则会检查所有的 gem 更新到最新版本。一般来说你只需要在每次 Gemfile
修改后，执行 bundle install 即可。如果有套件关连性 bundle install
无法解决，它会提示你执行 bundle update。
</p>

<p>
什么时候该执行 bundle install 或 bundle update 呢？一般来说，总是执行
bundle install 即可。这个指令只会做必要的更新到
Gemfile.lock，执行速度较快，它不会帮你升级现有的 Gem。而 bundle update
会重新产生整个 Gemfile.lock 档案，更新所有 Gem
到最新版本。但是，一次升级太多套件，可能会造成除错上的困难。因此会建议如果要升级，请执行
bundle update gem_name 一次升级一个套件。
</p>

<p>
怎么知道可以升级哪些 Gem 呢？
</p>

<pre class="example">
bundle outdated
</pre>

<p>
这个指令就会列出有新版本可以升级的 gems。
</p>

<p>
如果你想知道打开套件的原始码，可以输入：
</p>

<pre class="example">
bundle open GEM_NAME
</pre>

<p>
这样就会用默认的编辑器打开了。
</p>

<p>
如何设定默认编辑器呢? 如果你使用 Mac 和 Bash 的话，编辑~/.bash_profile
加上 export EDITOR="vim"这样就会用 VIM 当作默认编辑器。
</p>
</div>
</div>

<div id="outline-container-orga19ea77" class="outline-3">
<h3 id="orga19ea77"><span class="section-number-3">6.2</span> 打包 Gems</h3>
<div class="outline-text-3" id="text-6-2">
<p>
执行以下指令，会将所有用到的 Gems 打包进 vendor/cache 目录。如此执行
bundle install 时就不会连线到 <a href="http://rubygems.org">http://rubygems.org</a> 下载套件。
</p>

<pre class="example">
bundle package
</pre>

<p>
什么时候需要用到这个功能呢？例如你希望布署的时候避免外部连线，或是你有非公开的
gems 不会上传到 <a href="http://rubygems.org">http://rubygems.org</a> 网站上。
</p>

<p>
如果你有非 Rails 的 script 需要执行(也就是放在 Gemfile 档案中的 Gem
所自行提供的执行档)，使用 bundle exec 可以正确的加载 Bundler
的环境。例如 bundle exec rspec spec/
</p>
</div>
</div>
</div>

<div id="outline-container-orge5c323c" class="outline-2">
<h2 id="orge5c323c"><span class="section-number-2">7</span> 名称惯例</h2>
<div class="outline-text-2" id="text-7">
<p>
在 Rails 中有一些命名上的惯例：
</p>
</div>

<div id="outline-container-orgfa7a2c2" class="outline-3">
<h3 id="orgfa7a2c2"><span class="section-number-3">7.1</span> 类别命名与自动加载</h3>
<div class="outline-text-3" id="text-7-1">
<p>
档名使用小写、单数，用底线区隔。例如当 Rails 看到一个 OrderItem
的类别或模组(Module)，它会在 Rails 设定的自动加载目录(包括 app/models 和
app/models/concerns 等等)中去加载叫做 order_item.rb 的档案，也就是自动
require "order_item"。
</p>

<p>
如果是有嵌套的类别或模组，例如
Admin::OrderItem，则会多一层目录，例如加载
app/models/admin/order_item.rb 的档案，也就是自动 require
"admin/order_item"。
</p>

<p>
如果你想要新增目录到 Rails 设定的自动加载目录，可以编辑
config/application.rb 加上
</p>

<p>
config.eager_load_paths += %W( #{config.root}/lib ) 这样就会自动加载 lib
目录了。如果你没有设定
eager_load_paths，或是你的档案没有依照惯例命名，那么你会需要在程式中手动
require 它。基本上，只要依照命名惯例，你不太需要在程式中写 require。
</p>

<p>
eager_load_paths 目录是指 Rails 会自动根据命名惯例加载，而 Ruby 的
$LOAD_PATH 常数则是 require 时会寻找的目录。像 lib 这个目录 Rails
默认就只有加到 $LOAD_PATH 之中，所以你放在 lib 的档案是可以 require
到，但是因为默认没有加到 eager_load_paths 之中，所以没有自动加载的机制。
</p>
</div>
</div>

<div id="outline-container-orgd831112" class="outline-3">
<h3 id="orgd831112"><span class="section-number-3">7.2</span> Model 命名</h3>
<div class="outline-text-3" id="text-7-2">
<p>
类别名称使用大写、单数，没有底线。而档名使用小写、单数，用底线。数据库表格名称用小写且为复数。例如：
</p>

<ul class="org-ul">
<li>数据库表格 line_items</li>
<li>档名 app/models/line_item.rb</li>
<li>类别名称 LineItem</li>
</ul>
</div>
</div>

<div id="outline-container-org1c99b59" class="outline-3">
<h3 id="org1c99b59"><span class="section-number-3">7.3</span> Controller 命名</h3>
<div class="outline-text-3" id="text-7-3">
<p>
假设有一个 stores controller 的话：
</p>

<ul class="org-ul">
<li>档名 app/controllers/stores_controller.rb</li>
<li>类别名称 StoresController</li>
</ul>

<p>
如果需要将 controllers 档案做分类，这时候可以使用
Module，将档案放在子目录下，例如后台专用的 controllers：
</p>

<ul class="org-ul">
<li>档名 app/controllers/admin/stores_controller.rb</li>
<li>类别名称 Admin::StoresController</li>
</ul>
</div>
</div>

<div id="outline-container-org92fef0f" class="outline-3">
<h3 id="org92fef0f"><span class="section-number-3">7.4</span> View 命名</h3>
<div class="outline-text-3" id="text-7-4">
<p>
例如一个叫做 People 的 controller，其中的 index action：
</p>

<ul class="org-ul">
<li>档名 app/views/people/index.html.erb</li>
<li>Helper 名称 module PeopleHelper</li>
<li>档名 app/helpers/people_helper.rb</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgc407577" class="outline-2">
<h2 id="orgc407577"><span class="section-number-2">8</span> Rails 元件导览</h2>
<div class="outline-text-2" id="text-8">
<p>
Rails 包含许多个别的函式库元件：
</p>

<ul class="org-ul">
<li>Action Pack</li>
<li>Action Controller</li>
<li>Action Dispatch</li>
<li>Action View</li>
<li>Action Mailer</li>
<li>Active Model</li>
<li>Active Record</li>
<li>Active Support</li>
<li>Railties</li>
</ul>
</div>

<div id="outline-container-org7a5927a" class="outline-3">
<h3 id="org7a5927a"><span class="section-number-3">8.1</span> Action Pack</h3>
<div class="outline-text-3" id="text-8-1">
<p>
Action Pack 是个包含 Action Controller、Action View 和 Action Dispatch
的 gem。也就是 "MVC" 中的 "VC" 部分。
</p>
</div>
</div>

<div id="outline-container-orgde17829" class="outline-3">
<h3 id="orgde17829"><span class="section-number-3">8.2</span> Action Controller</h3>
<div class="outline-text-3" id="text-8-2">
<p>
Action Controller 是 Rails 应用程式中，管理 Controllers 的元件。Action
Controller 框架处理传给 Rails 的 HTTP 请求，萃取出参数，然后分派给所属的
Action。Action Controller 还提供了 session 管理、样板演算显示(template
rendering) 和 redirect 功能。
</p>
</div>
</div>

<div id="outline-container-org8e7fce6" class="outline-3">
<h3 id="org8e7fce6"><span class="section-number-3">8.3</span> Action View</h3>
<div class="outline-text-3" id="text-8-3">
<p>
Action View 负责 Rails 应用程式中的 Views。它默认可以产生 HTML 或 XML
输出。Action View 负责样板的演算显示(template
rendering)，包括嵌套(nesting)或局部(partial)样板，甚至也内建支援一些
Ajax。
</p>
</div>
</div>

<div id="outline-container-org7b7a6d5" class="outline-3">
<h3 id="org7b7a6d5"><span class="section-number-3">8.4</span> Action Dispatch</h3>
<div class="outline-text-3" id="text-8-4">
<p>
Action Dispatch 处理 HTTP 请求的路由(routing)，它把 HTTP
请求发派(dispatch)到它该去的地方，也许是你的应用程式或其他 Rack 程式。
</p>
</div>
</div>

<div id="outline-container-org2d89520" class="outline-3">
<h3 id="org2d89520"><span class="section-number-3">8.5</span> Action Mailer</h3>
<div class="outline-text-3" id="text-8-5">
<p>
Action Mailer 是个建构 E-mail 功能的框架。你可以使用 Action Mailer
来接收来信，或是使用样板来寄出纯文字或复杂的 multipart 信件。
</p>
</div>
</div>

<div id="outline-container-orga078bac" class="outline-3">
<h3 id="orga078bac"><span class="section-number-3">8.6</span> Active Model</h3>
<div class="outline-text-3" id="text-8-6">
<p>
Active Model 在 Action Pack gem 和 ORM gem (例如 Active Record)
之间定义了一组接口。Active Model 允许 Rails 可以依你的需求把 Active
Record 换成其他 ORM 框架。Active Model 通常应用在无数据库的模型中，使用
<code>include ActiveModel::Validations</code> 类似方式包含相应功能。
</p>
</div>
</div>

<div id="outline-container-orgf9c83d8" class="outline-3">
<h3 id="orgf9c83d8"><span class="section-number-3">8.7</span> Active Record</h3>
<div class="outline-text-3" id="text-8-7">
<p>
Active Record 是 Rails 应用程式中的 Models
基础。它不依存特定的数据库系统，提供了 CRUD
功能、先进的查询能力以及可以跟其他 Models 关联的本事。
</p>
</div>
</div>

<div id="outline-container-orga6e504a" class="outline-3">
<h3 id="orga6e504a"><span class="section-number-3">8.8</span> Active Support</h3>
<div class="outline-text-3" id="text-8-8">
<p>
Active Support 是 Rails 里的工具函式库，它也扩充了一些 Ruby
标准函式库。除了被用在 Rails 核心程式中，你也可以在你的程式中使用。
</p>
</div>
</div>

<div id="outline-container-org17e9719" class="outline-3">
<h3 id="org17e9719"><span class="section-number-3">8.9</span> Railties</h3>
<div class="outline-text-3" id="text-8-9">
<p>
Railties 是 Rails 的核心程式码，用来把以上各种的框架函式库以及 Plugin
全部组合在一起。
</p>
</div>
</div>
</div>

<div id="outline-container-org99fa3b3" class="outline-2">
<h2 id="org99fa3b3"><span class="section-number-2">9</span> 国际化 i18</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-orge718a26" class="outline-3">
<h3 id="orge718a26"><span class="section-number-3">9.1</span> 普通信息国际化</h3>
<div class="outline-text-3" id="text-9-1">
<p>
到 application.rb 中添加
</p>

<pre class="example">
config.i18n.default_locale = 'zh-CN'
</pre>

<p>
修改配置文件之后不忘忘记重启 rails 来加载新的配置。 然后的要来添加
config/locals/zh-CN.yml 文件。
</p>

<p>
可以参考 这里 来书写 zh-CN.yml
文件，注意缩进关系，使用两个空格做为一个缩进级别，不要用
tab。基本上就是写成
</p>

<pre class="example">
zh-CN:
  hello: 你好
</pre>

<p>
先举个简单的例子，到 application.html.erb 中
</p>

<pre class="example">

``` html+erb
&lt;li&gt;&lt;%= link_to t("navbar.about"), "/about" %&gt;&lt;/li&gt;
</pre>

<p>
这样再来查看一下 html 源码，就可以知道该添加什么内容了。
</p>
</div>
</div>
