_org/_posts/dev/2018-07-30-rails.org
** 表单报错信息国际化

再来到 signup 页面。点击注册按钮，看到如下的报错信息：

#+BEGIN_EXAMPLE
    translation missing: zh-CN.activerecord.errors.models.user.attributes.name.blank
#+END_EXAMPLE

这样就知道应该添加点什么内容到 zh-CN.yml
中了，实际操作的时候也可以直接从 rails-i18n gem 中拷贝。

#+BEGIN_EXAMPLE
    zh-CN:
      navbar:
        about: 关于
      activerecord:
        errors:
          models:
            user:
              attributes:
                name:
                  blank: 用户名不能为空
                  taken: 用户已经存在
                email:
                  blank: 请填写邮箱地址
                  taken: 邮箱已经被占用
                password:
                  blank: 密码不能为空
                password_confirmation:
                  confirmation: 两次输入密码不相同
#+END_EXAMPLE

** 更改 local 设置

刚才咱们是用手动修改 application.rb
文件实现的，咱们的网站就是个中文网站，所以这样就够了。
对于一个要同时支持多国语言的网站，就要考虑到和更加灵活的改变 local
设置的方法了。 可以参考
[[https://guides.rubyonrails.org/i18n.html#setup-the-rails-application-for-internationalization][这里]]
。

* References

#+BEGIN_QUOTE
  本文是我的学习笔记，内容参考了网上资源，为了方便自己查询使用，做了一些修改整理。
  笔记内容摘录于下列文章，相应权利归属原作者，如有未列出的或有不妥，请联系我立即增补或删除。
#+END_QUOTE

- https://ihower.tw/rails/index-cn.html
