_posts/dev/2018-07-30-rails.html

<div id="outline-container-org4660022" class="outline-3">
<h3 id="org4660022"><span class="section-number-3">9.2</span> 表单报错信息国际化</h3>
<div class="outline-text-3" id="text-9-2">
<p>
再来到 signup 页面。点击注册按钮，看到如下的报错信息：
</p>

<pre class="example">
translation missing: zh-CN.activerecord.errors.models.user.attributes.name.blank
</pre>

<p>
这样就知道应该添加点什么内容到 zh-CN.yml
中了，实际操作的时候也可以直接从 rails-i18n gem 中拷贝。
</p>

<pre class="example">
zh-CN:
  navbar:
    about: 关于
  activerecord:
    errors:
      models:
        user:
          attributes:
            name:
              blank: 用户名不能为空
              taken: 用户已经存在
            email:
              blank: 请填写邮箱地址
              taken: 邮箱已经被占用
            password:
              blank: 密码不能为空
            password_confirmation:
              confirmation: 两次输入密码不相同
</pre>
</div>
</div>

<div id="outline-container-org05eb63c" class="outline-3">
<h3 id="org05eb63c"><span class="section-number-3">9.3</span> 更改 local 设置</h3>
<div class="outline-text-3" id="text-9-3">
<p>
刚才咱们是用手动修改 application.rb
文件实现的，咱们的网站就是个中文网站，所以这样就够了。
对于一个要同时支持多国语言的网站，就要考虑到和更加灵活的改变 local
设置的方法了。 可以参考
<a href="https://guides.rubyonrails.org/i18n.html#setup-the-rails-application-for-internationalization">这里</a>
。
</p>
</div>
</div>
</div>

<div id="outline-container-org88d4408" class="outline-2">
<h2 id="org88d4408"><span class="section-number-2">10</span> References</h2>
<div class="outline-text-2" id="text-10">
<blockquote>
<p>
本文是我的学习笔记，内容参考了网上资源，为了方便自己查询使用，做了一些修改整理。
笔记内容摘录于下列文章，相应权利归属原作者，如有未列出的或有不妥，请联系我立即增补或删除。
</p>
</blockquote>

<ul class="org-ul">
<li><a href="https://ihower.tw/rails/index-cn.html">https://ihower.tw/rails/index-cn.html</a></li>
</ul>
</div>
</div>
